# OpeningCutAll Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..OpeningFailures..::..OpeningCutAll Property
BuiltInFailures..::..OpeningFailures Class See Also
---
Opening completely removes its host
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId OpeningCutAll { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property OpeningCutAll As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ OpeningCutAll {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..OpeningFailures Class
Autodesk.Revit.DB Namespace